In [2]:
#IS362 Moises Perez Project 3

In [1]:
import pandas as pd
import sqlalchemy as sqla

engine = sqla.create_engine("mysql+pymysql://{user}:{pw}@localhost/{db}"
                       .format(user="root",
                               pw="mmp11377",
                               db="chinook"))
sql = '''SELECT c.LastName, c.FirstName, t.Name, a.Title
         FROM Customer as c
         LEFT JOIN Invoice as i
         ON c.CustomerId = i.CustomerId
         LEFT JOIN InvoiceLine as il
         ON i.InvoiceId = il.InvoiceId
         LEFT JOIN Track as t
         ON il.TrackId = t.TrackId
         LEFT JOIN Album as A
         ON t.AlbumId = a.AlbumId
         ORDER BY c.LastName, c.FirstName'''

pd.read_sql(sql, engine).head(5)

,LastName,FirstName,Name,Title
0,Almeida,Roberto,Right Next Door to Hell,Use Your Illusion I
1,Almeida,Roberto,In The Evening,In Through The Out Door
2,Almeida,Roberto,Fool In The Rain,In Through The Out Door
3,Almeida,Roberto,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Almeida,Roberto,Caso Você Queira Saber,Minas

In [2]:
engine1 = sqla.create_engine("mysql+pymysql://{user}:{pw}@localhost/{db}"
                       .format(user="root",
                               pw="mmp11377",
                               db="chinook"))
connection = engine1.connect()
query = '''SELECT c.LastName, c.FirstName, t.Name, a.Title
         FROM Customer as c
         LEFT JOIN Invoice as i
         ON c.CustomerId = i.CustomerId
         LEFT JOIN InvoiceLine as il
         ON i.InvoiceId = il.InvoiceId
         LEFT JOIN Track as t
         ON il.TrackId = t.TrackId
         LEFT JOIN Album as A
         ON t.AlbumId = a.AlbumId
         ORDER BY c.LastName, c.FirstName'''
result = connection.execute(query)
count= 0
for row in result:
    if count < 5:
        print(row)
    count += 1
connection.close()

('Almeida', 'Roberto', 'Right Next Door to Hell', 'Use Your Illusion I')
('Almeida', 'Roberto', 'In The Evening', 'In Through The Out Door')
('Almeida', 'Roberto', 'Fool In The Rain', 'In Through The Out Door')
('Almeida', 'Roberto', 'Saudade Dos Aviões Da Panair (Conversando No Bar)', 'Minas')
('Almeida', 'Roberto', 'Caso Você Queira Saber', 'Minas')